sensorOpt/1.5deg/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    down
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          400;
        startFace       215475;
    }
    right
    {
        type            patch;
        nFaces          200;
        startFace       215875;
    }
    up
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          400;
        startFace       216075;
    }
    left
    {
        type            patch;
        nFaces          200;
        startFace       216475;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          107888;
        startFace       216675;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          107888;
        startFace       324563;
    }
    wing
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          444;
        startFace       432451;
    }
)

// ************************************************************************* //
